app/controllers/admin/users_controller.rb

    def index
      @admin_users = User.all
---
SELECT "users".* FROM "users"

    def create
      @admin_user = User.new(admin_user_params)

      respond_to do |format|
        if @admin_user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
      respond_to do |format|
        if @admin_user.update(admin_user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$10$K87oviYJurhPWWkrqd4kbeyufmo7fSXb3/sQfPeUtWfo04bsNMKkG"], ["updated_at", "2015-04-12 07:03:06.741371"], ["id", 2]]

    def set_admin_user
      @admin_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]